<?php

/* Возвращает список категорий для товаров ==================
-------------------------------------------------------------
Обязательные параметры
-------------------------------------------------------------
& api_method        |  метод API
& access_token      |  ключ доступа к API
& group_id          |  идентификатор сообщества
-------------------------------------------------------------
Дополнительные параметры
-------------------------------------------------------------
& v                 |  версия API
& offset            |  смещение относительно первой категории
& count             |  количество возвращаемых категорий
============================================================= */

// Запрашиваем список категорий
$getCategories = $vk->market__getCategories([
    'owner_id' => "-$group_id",
    'offset' => $offset ? $offset : 0,
    'count' => $count ? $count : 10
]);

// Если список не получен
if (!isset($getCategories['count'])) {
    return $getCategories; // выводим отчёт об ошибке
}

$success = json_encode($getCategories, JSON_UNESCAPED_UNICODE);
return $success; // Выводим отчёт об успешном удалении товара
