<?php

require_once MODX_BASE_PATH . "assets/snippets/apiVK/class.apiVK.php";

// Проверяем наличие обязательных параметров
if (!isset($api_method)) {
    return '{"error":{"error_code":"required","error_msg":"Not found: api_method"}}';
}
if (!isset($access_token)) {
    return '{"error":{"error_code":"required","error_msg":"Not found: access_token"}}';
}

$v = isset($v) ? $v : '5.101';
$vk = new apiVK($access_token, $v);

switch ($api_method) {

    case 'market.add':

        /* Добавляет новый товар ====================================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        & name              |  название товара
        & description       |  описание товара
        & category_id       |  идентификатор категории товара
        & price             |  цена товара
        & image             |  путь к изображению
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        & album_ids         |  подборки, куда добавить товар (через запятую)
        & deleted           |  статус товара (удалён или не удалён)
        & url               |  ссылка на сайт товара
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.add.php";
        break;

    case 'market.addAlbum':

        /* Добавляет новую подборку =================================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        & title             |  название подборки
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        & image             |  путь к изображению
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.addAlbum.php";
        break;

    case 'market.addToAlbum':

        /* Добавляет товар в подборки ===============================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        & item_id           |  идентификатор товара
        & album_ids         |  подборки, куда добавить товар (через запятую)
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.addToAlbum.php";
        break;

    case 'market.delete':

        /* Удаляет товар из сообщества ==============================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        & item_id           |  идентификатор товара
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.delete.php";
        break;

    case 'market.deleteAlbum':

        /* Удаляет подборку с товарами ==============================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        & album_id          |  идентификатор подборки
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.deleteAlbum.php";
        break;

    case 'market.getAlbums':

        /* Возвращает список подборок ===============================
        -------------------------------------------------------------
        Обязательные параметры
        -------------------------------------------------------------
        & api_method        |  метод API
        & access_token      |  ключ доступа к API
        & group_id          |  идентификатор сообщества
        -------------------------------------------------------------
        Дополнительные параметры
        -------------------------------------------------------------
        & v                 |  версия API
        & offset            |  смещение относительно первой найденной подборки
        & count             |  количество возвращаемых подборок
        ============================================================= */

        return require_once MODX_BASE_PATH . "assets/snippets/apiVK/methods/market.getAlbums.php";
        break;
}
