<?php

if (!defined('MODX_BASE_PATH')) {
    die('What are you doing? Get out of here!');
}

require_once MODX_BASE_PATH . 'assets/modules/VKmarket/class.VKmarket.php';

/* ================================================================================
===================================================================================
include_once('eLists.class.php');
$eL = new eListsModule($modx);
$eL->Run();
===================================================================================
================================================================================ */


/********************* шаблон вывода в модуль ************************/
$output = <<<OUT
<!doctype html>
<html lang="ru">
<head>
	<title>Работа с API ВКонтакте</title>
</head>
<body>
	<h1>Управление списками</h1>
    <div class="sectionBody"></div>
</body>
</html>
OUT;
/****************** конец формирования шаблона в модуль ************/

//выводим все в область контента модуля
echo $output;
